==================
Simple function call
==================

note("c a f e")

---

(source_file
  (expression_statement
    (call_expression
      (identifier)
      (arguments
        (primary_expression
          (pattern_string
            (pattern
              (element)
              (element)
              (element)
              (element))))))))

==================
Function call with method chain
==================

note("c a f e").s("piano")

---

(source_file
  (expression_statement
    (call_expression
      (member_expression
        (call_expression
          (identifier)
          (arguments
            (primary_expression
              (pattern_string
                (pattern
                  (element)
                  (element)
                  (element)
                  (element))))))
        (identifier))
      (arguments
        (primary_expression
          (pattern_string
            (pattern
              (element))))))))

==================
Multiple method chains
==================

note("a3 c#4 e4 a4")
  .s("sawtooth")
  .cutoff(500)

---

(source_file
  (expression_statement
    (call_expression
      (member_expression
        (call_expression
          (member_expression
            (call_expression
              (identifier)
              (arguments
                (primary_expression
                  (pattern_string
                    (pattern
                      (element)
                      (element)
                      (element)
                      (element))))))
            (identifier))
          (arguments
            (primary_expression
              (pattern_string
                (pattern
                  (element))))))
        (identifier))
      (arguments
        (primary_expression
          (number))))))

==================
Number argument
==================

s("bd").gain(0.5)

---

(source_file
  (expression_statement
    (call_expression
      (member_expression
        (call_expression
          (identifier)
          (arguments
            (primary_expression
              (pattern_string
                (pattern
                  (element))))))
        (identifier))
      (arguments
        (primary_expression
          (number))))))

==================
String argument with single quotes
==================

scale('C minor')

---

(source_file
  (expression_statement
    (call_expression
      (identifier)
      (arguments
        (primary_expression
          (string))))))

==================
Multiple arguments
==================

s("bd").room(0.5, 0.8)

---

(source_file
  (expression_statement
    (call_expression
      (member_expression
        (call_expression
          (identifier)
          (arguments
            (primary_expression
              (pattern_string
                (pattern
                  (element))))))
        (identifier))
      (arguments
        (primary_expression
          (number))
        (primary_expression
          (number))))))

==================
Signal as argument
==================

s("bd").cutoff(sine.range(500, 2000))

---

(source_file
  (expression_statement
    (call_expression
      (member_expression
        (call_expression
          (identifier)
          (arguments
            (primary_expression
              (pattern_string
                (pattern
                  (element))))))
        (identifier))
      (arguments
        (call_expression
          (member_expression
            (primary_expression
              (identifier))
            (identifier))
          (arguments
            (primary_expression
              (number))
            (primary_expression
              (number))))))))

==================
Multiple expressions
==================

note("c e g")
s("bd sd")

---

(source_file
  (expression_statement
    (call_expression
      (identifier)
      (arguments
        (primary_expression
          (pattern_string
            (pattern
              (element)
              (element)
              (element)))))))
  (expression_statement
    (call_expression
      (identifier)
      (arguments
        (primary_expression
          (pattern_string
            (pattern
              (element)
              (element))))))))
